[{
"title": "Flats and Condominiums",
"documentTitle": "URA Guidelines",
"url": "/opendoc-ura-guidelines/flats_condominiums.html",
"text": "Flats and Condominiums"
}
,{
"title": "Advisory Notes",
"documentTitle": "URA Guidelines",
"url": "/opendoc-ura-guidelines/flats_condominiums.html#advisory-notes",
"text": "Advisory Notes The guidelines set out in this handbook for the various development control parameters will generally be applied by URA in the consideration of a development application. However, if the circumstances of a case or the planning considerations relevant to a case so warrant, URA may in its discretion decide to depart from these general guidelines. Persons intending to carry out a development are advised to take this into consideration in the conduct of their affairs and check with URA through enquiries or development applications to confirm if their proposals can be allowed. The guidelines, principles and illustrations found in the handbook series are not exhaustive in covering all possible site conditions and building designs. In evaluating the development applications, URA reserves the right to evaluate and impose conditions not covered in the handbook in respond to the specific design of the development proposal depending on merits."
}
,{
"title": "Guidelines at a Glance",
"documentTitle": "URA Guidelines",
"url": "/opendoc-ura-guidelines/flats_condominiums.html#guidelines-at-a-glance",
"text": "Guidelines at a Glance"
}
,{
"title": "Introduction",
"documentTitle": "URA Guidelines",
"url": "/opendoc-ura-guidelines/flats_condominiums.html#introduction",
"text": "Introduction Flats and condominiums are non-landed residential developments approved for dwelling purpose. Each residential unit shall have a satisfactory layout for residential purpose comprising bedrooms, a living room, a dining room, a kitchen and toilets. Flats and condominiums are allowed in areas zoned Residential, Commercial &amp; Residential, Residential with Commercial at 1st Storey, White, and Residential/Institution (in the Geylang Planning Area) in the Master Plan. They are not allowed in areas designated only for landed housing developments, except for existing flats and condominiums previously approved in such areas. Condominiums typically offer more generous provision of communal and recreational facilities than flats developments, and have larger Site Area and more Common Boundary Setback. For sites zoned Commercial/Residential or Residential with Commercial at 1st Storey, refer to the Commercial Handbook for the relevant guidelines."
}
,{
"title": "Serviced Apartments (akin to Residential Use)",
"documentTitle": "URA Guidelines",
"url": "/opendoc-ura-guidelines/flats_condominiums.html#serviced-apartments-akin-to-residential-use",
"text": "Serviced Apartments (akin to Residential Use) Serviced Apartments (SA) may be allowed in Residential zone and may also be considered on mixed-use sites where residential use may be allowed. SAs are self-contained apartments with kitchenettes/kitchens, and provide support services such as concierge, common dining areas, housekeeping and/or laundry for the residents. SAs shall be rented out for lodging purposes for a minimum period of 7 days or longer, and shall be developed and/or managed under one ownership. Strata subdivision of SAs is strictly not allowed. Support services such as concierge, housekeeping and/or laundry provided for the residents of Serviced Apartments may be allowed. In addition, limited bar/lounge facilities may be permitted, subject to a maximum of 0.3% of the total residential GFA. SAs within Residential zones (incl. mixed use sites with a residential component) Applicants may submit an Outline Application to URA to determine the suitability of the location, the Gross Plot Ratio (GPR) control and the storey height for a proposed SA development. SAs may be allowed where the site fronts a major or arterial road (ie Category 1, 2, 3 roads or equivalent) at the fringe of a residential area; or the site is located in a mixed-use area (eg commercial centres, business parks, or abutting medical hubs). SAs shall not be allowed within the designated Landed Housing Areas; areas where SAs may potentially cause dis-amenities to the neighbouring residents; and areas where there are already dis-amenities in the surroundings (examples of such areas can be found under the Hotels Handbook). SAs within mixed-use areas SAs may be considered in mixed-use areas and are not restricted by the category of roads fronting the site. "
}
,{
"title": "Gross Plot Ratio",
"documentTitle": "URA Guidelines",
"url": "/opendoc-ura-guidelines/flats_condominiums.html#gross-plot-ratio",
"text": "Gross Plot Ratio The development potential of a residential development is guided by the Gross Plot Ratio (GPR) specified in the Master Plan (MP). The MP plot ratio is the upper bound as it may not always be achievable because of site limitations like shape of the plot, site topography or ground conditions, building setbacks, building height or technical requirements of other authorities that may affect the site. The area of the land required to be set aside for drainage reserve1 (DR) and/or road reserve2 (RR) to be vested in the State may be included in the site area to compute the Gross Floor Area (GFA) for a GPR. GPR for sites where vesting is required"
}
,{
"title": "Bonus GFA Incentive Schemes",
"documentTitle": "URA Guidelines",
"url": "/opendoc-ura-guidelines/flats_condominiums.html#bonus-gfa-incentive-schemes",
"text": "Bonus GFA Incentive Schemes The Bonus GFA schemes applicable to flats and condominiums are: Balcony Incentive Scheme Refer to section on Balconies, Private Enclosed Spaces, Private Roof Terraces, &amp; Indoor Recreation Spaces. Conserved Bungalows Scheme The GFA of conserved bungalows may be computed as additional GFA over and above the GPR stipulated in the prevailing Master Plan. Eligibility: The incentive is applicable to all bungalows meeting the following criteria: Volunteered for conservation or designated for conservation by URA; and Located on a site with GPR control. Additional GFA from the bungalow shall be exempted from payment of Development Charge. Submission: Submissions of Development Applications involving conserved bungalows shall be made only by a Qualified Person (QP), who is registered as an Architect under the Architects Act and who has in force a practising certificate issued under the Act. The QP shall demarcate the area of the conserved bungalow in the submission and declare the additional GFA from the conserved bungalow in the application form. Indoor Recreation Spaces Scheme Refer to section on Balconies, Private Enclosed Spaces, Private Roof Terraces, &amp; Indoor Recreation Spaces. The Bonus GFA is allowed over and above the MP GPR subject to a maximum of 10% of the MP GPR. When the site is redeveloped in future, the additional GFA already used under the bonus GFA incentive schemes shall not be carried over. In other words, the GPR for the site shall revert to the GPR specified in the prevailing MP. Although a site may make use of multiple bonus GFA incentive schemes, the total bonus GFA shall not exceed the overall cap of 10% above the MP GPR."
}
,{
"title": "Balconies, Private Enclosed Spaces, Private Roof Terraces and Indoor Recreation Spaces",
"documentTitle": "URA Guidelines",
"url": "/opendoc-ura-guidelines/flats_condominiums.html#balconies-private-enclosed-spaces-private-roof-terraces-and-indoor-recreation-spaces",
"text": "Balconies, Private Enclosed Spaces, Private Roof Terraces and Indoor Recreation Spaces Balconies The GFA of balconies in flats and condominium developments may be computed over and above the Master MP allowable GPR, subject to a cap of 7% inclusive of planter boxes, if any. The additional GPR may only be used for balcony GFA and shall not form the future development potential of the site upon redevelopment. The additional balcony GFA shall be subject to payment of Development Charge or Differential Premium, where applicable. When submitting development proposals with balconies, the QP is required to demarcate the balcony area clearly on the Calculation Plan and declare the total balcony area that exceeds the MP allowable GPR. Existing developments whose GPR have exceeded the Master Plan intensity may qualify for the additional balcony GFA, subject to a cap of 7% of the existing and approved GPR inclusive of planter boxes, if any. This does not apply to existing developments whose building form, height or use are not in accordance with the planning intention of the Master Plan, Building Height Plan or Special and Detailed Control Plan. For instance, a flats development within a designated landed housing area shall not qualify for the bonus balcony GFA. Balcony designs shall adhere to the following guidelines and submission requirements: Location Balconies shall be located away from M&amp;E areas to safeguard the quality and usability of these spaces. Openness Balconies shall have a continuous perimeter opening of at least 40%.   Balcony Perimeter Opening The portions of a balcony that face a parapet wall (eg a wall between the balconies of two adjoining units) not exceeding 1.3m in height are considered “open”. The QP shall show the computation of perimeter opening for the proposed balconies on the floor plans. Size Total balcony size for each dwelling unit is capped at 15% of the internal nett unit size. This excludes voids, balconies, air-conditioner ledges and other external areas. The intention is to ensure that the balconies are not disproportionately large relative to the main unit. Width Balconies shall have a minimum width of 1.5m as measured from the external building wall. Exceptions to the width requirement may be considered arising from the design merit of the proposal, such as a curved or odd-shaped balcony but the balcony shall be reasonably sized. Access Balconies with exclusive access from the kitchen/yard/utility space are treated as service balconies and do not qualify for bonus GFA. Balconies which serve as the only access into a dwelling unit do not qualify for bonus GFA. Screen Balconies shall not be enclosed with walls or glass panels as balconies are meant to be semi-outdoor spaces. Balcony screens may can be allowed provided: The balcony screens can be drawn open or retracted fully; and The balcony screens allow for natural ventilation/air flow within the balcony at all times, even when the screens are fully drawn. Balcony screens shall be designed upfront and approved as part of the Development Application process for all new residential developments with proposed balconies (including the residential component of mixed-use developments). Developers may propose a single screen design or a few designs for the end-users to choose from. Developers shall provide a Letter of Undertaking to be submitted at the Development Application Stage, downloadable via the following link (PDF, 351 KB). The plans shall show the balcony screens in elevation view; one view fully retracted and another view fully closed with a fully retracted view in a plan view. The porosity of the balcony screen shall be annotated, and if the screening is louvred, the individual slats shall be fixed (ie not adjustable). Section cuts of the louvres shall be provided to show that the screening is naturally ventilated at all times, even when closed. If sales gallery and/or show unit(s) is/are erected for the development, developers shall be required to install the approved balcony screen in its actual scale in the show unit of the development. If the balcony screens are not erected within the show unit as it may block the entrance, the developer shall erect a mock-up of the full approved balcony screen elsewhere within the show gallery premises. Mock-ups showing only parts of the approved balcony screen or scaled down versions of the balcony screens installed at the balcony are not allowed. For developments with multiple approved balcony screen designs, mock-ups of all the balcony screen designs shall be installed at the show gallery of the development. A written notice and a detailed drawing of the approved balcony screen showing the overall specifications shall be displayed next to the mock-up balcony screen. The written notice shall include the following: Explicitly state that ‘The balcony shall not be enclosed except with the approved balcony screen’. For balconies where the screen is not installed within the balcony of the show unit itself, the notice shall refer to the mock up balcony screen installed in the other show unit or sales gallery. State that the purchasers shall have the option to have the balcony screen pre-installed in the units and make clear if the purchasers have to bear separate costs for its installation. Under rule 10(4) of Housing Developer Rules, developers shall explicitly state in the unit floor plan in Form 3 that “Balconies shall not to be enclosed except with a balcony screen which has been approved and complies with the Competent Authority’s guidelines”. Developers shall provide purchasers the option to have the approved screening pre-installed at their balconies. This option shall be offered via a side letter at the point of issuance of the Option to Purchase. This is not applicable for developers who choose to pre-install approved screens for all balconies in the development. For existing developments without balcony screens, screens may be installed provided they fulfil the performance criteria above, and MCST’s consent is obtained. Safety grilles are not considered as balcony screens, and such installation does not require planning approval. Private Enclosed Spaces (PES) A Private Enclosed Space refers to a semi-outdoor area adjacent to a strata unit. It forms part of the private strata area of units which are sold to homeowners. All PES in non-landed residential developments submitted on or after 12 January 2013 shall be counted as GFA under the 7% maximum bonus GFA allowed beyond the Master Plan (MP) stipulated GPR. PES approved before 12 January 2013 may not be counted towards the development’s GFA. To qualify for the bonus GFA scheme, PES shall comply with the guidelines to retain a semi-outdoor character. The structures shall comply with the relevant requirements from technical agencies. The guidelines for PES are in the table below. Guidelines on PES: Covers Full covers (subject to compliance with SCDF’s requirements) over the entire PES may be allowed provided they comply with development control parameters such as building setback and site coverage. PES covers shall be approved upfront as part of the Development Application process. Developers may propose a single cover design, or a few designs for the homeowners to choose from. Developers shall install a 2m wide (minimum) cover from the external wall. Homeowners shall be given the flexibility and choice over the remaining cover for the rest of the PES beyond 2m, as long as it is one of the approved designs and provided they obtain MCST clearance prior to installation. MCSTs may use these pre-approved designs to guide homeowners who wish to extend their cover beyond 2m. Setback The PES cover shall be located outside the setback line, as the covers would add to the bulk and massing of the building. PES Fencing Any PES fencing that defines the extent of the PES shall not exceed 1m in height. This is to ensure the open and semi-outdoor nature of the PES. A 1.8m screening wall may be proposed between PES adjoining each other for privacy purposes. Full height separating walls between adjoining PES may be allowed if they are to meet FSSD’s requirements. Private Roof Terraces (PRT) A Private Roof Terrace refers to a semi-outdoor area located at the roof level of a strata unit. It forms part of the private strata area of units which are sold to homeowners. To avoid complications at the strata-subdivision stage, these should be clearly annotated as ‘Private Roof Terraces’. All PRT of developments approved on or after 12 January 2013 shall be counted as GFA under the 7% maximum bonus GFA allowed beyond the Master Plan (MP) stipulated GPR. PRT approved before 12 January 2013 may not be counted towards the development’s GFA. To qualify for the bonus GFA scheme, PRT shall comply with the guidelines to retain a semi-outdoor character. The structures shall comply with the relevant requirements from technical agencies. The guidelines for PRT are in the table below. Guidelines for Roof Terraces: Location Private roof terraces may be allowed on the flat roof of a building. Private roof terraces shall not be allowed on top of the attic level. Covers Coverings (subject to compliance with SCDF’s requirements) may be allowed on PRT provided the development complies with the applicable storey height controls. Such covers shall be approved upfront as part of the development application process. Developers may propose a single cover design, or a few designs for the homeowners to choose from. Installation of the covers is optional. Homeowners may choose from one of the approved designs, should they wish to cover the PRT subsequently. Homeowners shall obtain MCST clearance prior to installation. MCSTs may use the pre-approved designs to guide homeowners who wish to install covers. Height Control If the storey height control has been maxed out Any covers on roof terrace floor shall be setback according to the 45-degree envelope taken from the springing line1. The structures shall not exceed 5m at any point, subject to the technical height controls, where applicable. If the storey height control has not been maxed out The roof terrace shall be taken to be an additional storey. Covers may be allowed over the entire roof terrace floor. The overall height of the development shall comply with the technical height controls, where applicable. Structures within Private Roof Terraces To retain the open and semi-outdoor nature of the RT, any structures shall remain open-sided as viewed from the external façade. Indoor Recreation Spaces Private non-landed residential developments and the residential component of mixed-use developments may apply for the communal indoor recreation spaces to be counted as bonus GFA, provided such spaces are more than 0.6% of the total GFA of the development or 10sqm (whichever is higher). The bonus GFA shall be capped at 1% of total GFA, or the GFA of the residential component for mixed-use developments. If the proposed communal indoor recreation spaces are less than 0.6% of the total GFA of the development or 10sqm (whichever is higher), these spaces shall be counted under the main building GFA instead of bonus GFA. Examples of communal indoor recreation spaces that may qualify for this scheme include gyms, function rooms, libraries, game rooms and reading rooms. Developers may propose other forms of communal indoor recreation spaces for URA’s evaluation. These spaces shall be retained as common property and kept accessible to residents of the development. They shall only be used for non-commercial purposes. The indoor recreation space bonus GFA scheme shall apply to all development applications for new erection, amendments to approved developments or additions and alterations (A&amp;A) of existing private non-landed residential developments or mixed-use developments with a residential component. All additional GFA granted under the indoor recreation space bonus GFA scheme shall not form the future development potential of the site."
}
,{
"title": "Maximum Number of Dwelling Units",
"documentTitle": "URA Guidelines",
"url": "/opendoc-ura-guidelines/flats_condominiums.html#maximum-number-of-dwelling-units",
"text": "Maximum Number of Dwelling Units The following Dwelling Unit (DU) size controls shall not apply to HDB flats and Serviced Apartments, and developments within the Central Area (PDF, 436 KB). As a guide, all self-contained DUs island-wide shall be more than 35sqm nett in internal area. The formulae in the following tabs for calculating the maximum allowable number of DUs are intended to derive an upper bound figure1. The actual number of DUs that may be supported in any development shall be assessed based on the site context, existing site conditions and the impact on the local infrastructure. URA shall assess the overall layout, design and unit sizes of the residential development proposals, and may add other requirements where necessary to protect the quality of the living environment. There shall be provision of a good mix of unit sizes including larger DUs that can cater to the needs of larger families. An example is a development where about 20% of the DUs have a nett internal area of at least 100sqm, excluding voids, balconies, air-conditioner ledges and other external areas, and units of nett internal area less than 50sqm shall not exceed about 20% of the proposed DUs3. For flats and condominiums outside the Central Area For all flats and condominium developments outside the Central Area, excluding the estates shown in Maps 2-10 (PDF, 1.93 MB), the maximum number of allowable DUs per residential development shall be determined based on the following formula: 2 Excludes bonus GFA (ie if the proposal is a mixed development, only the proposed GFA for the residential component shall be used in the calculation, excluding bonus GFA). 3 The GFA of any proposed strata landed units shall be excluded from the calculation in the formula. For flats and condominiums within the estates in Maps 2-10 For all flats and condominium developments in the estates outlined in Maps 2-10 (PDF, 1.93 MB) a more stringent DU guide shall be used. The maximum number of allowable DUs per residential development within these estates shall be determined based on the following formula: 2 Excludes bonus GFA (ie if the proposal is a mixed development, only the proposed GFA for the residential component shall be used in the calculation, excluding bonus GFA). 3 The GFA of any proposed strata landed units shall be excluded from the calculation in the formula."
}
,{
"title": "Site Area",
"documentTitle": "URA Guidelines",
"url": "/opendoc-ura-guidelines/flats_condominiums.html#site-area",
"text": "Site Area The minimum site area for a flats and condominium development is 1,000sqm and 4,000sqm respectively. Condominiums require larger site area to ensure that there is sufficient space for more communal and recreational facilities. For proposals where terrace or semi-detached houses breakaway for redevelopment into flats &amp; condominiums, the remaining adjacent lots shall be capable of redevelopment into flats &amp; condominiums. The remaining adjacent lots are known as left-behind lots, and shall fulfil the minimum site area of 1,000sqm. Minimum Site Area for Left-Behind Plots Conditions under which the minimum site area of 1000 sqm may be waived The owner(s) of the left-behind lot(s) do not wish to participate in the redevelopment despite being informed of the limited development potential of his/their land after it is left out of the redevelopment; and An agreement cannot be reached between the owner(s) of the left-behind lot(s) and the owner of the redevelopment proposal after extensive discussion. There shall be clear documentary evidence of prior negotiation with the owner(s) of the left-behind lot(s)."
}
,{
"title": "Site Coverage",
"documentTitle": "URA Guidelines",
"url": "/opendoc-ura-guidelines/flats_condominiums.html#site-coverage",
"text": "Site Coverage Site coverage ensures that there are adequate areas set aside for greenery and landscaping within the development. The computation of site coverage has been simplified to include all building structures that protrude more than 1m from the ground as seen from the top-down ‘Site Plan’ view, and is expressed as a percentage of the net site area. The net site area refers to the area of the site excluding areas to be vested to the State for public roads, public road widening reserves1, and drainage reserves2. The maximum site coverage for flats and condominiums is 50%. In the Development Application, the Site Plan shall include a separate site coverage layer for computation purposes. An example is shown below. Example of a Site Coverage Plan for Flats or Condominum Developments 1 Road Reserve: The plot of land to be vested in the State as required under the Street Works Act. It is demarcated by the line of Road Reserve in the Road Line Plan and the site boundary. 2 Drainage Reserve (DR): An area safeguarded for purposes of building or widening a public drain."
}
,{
"title": "Building Setback from Boundary",
"documentTitle": "URA Guidelines",
"url": "/opendoc-ura-guidelines/flats_condominiums.html#building-setback-from-boundary",
"text": "Building Setback from Boundary lats and condominiums shall be sufficiently set back from the road and common boundary. The setback distance is measured from the road reserve1 line or boundary line to the external wall of the flats, excluding land to be vested to the State for road or drainage or public purpose. The setback for flats and condominiums from public roads are determined by the road buffer, which is dependent on the category of the road that the site fronts and the height of development. For roads that are not categorised, the minimum road buffer of 7.5m applies. A green buffer shall also be set aside within the road buffer. The classification of the road category may be obtained from LTA’s Road Interpretation Plan (RIP). The type of road buffer &amp; setback are shown in the diagram above, and are detailed in Tables 1 &amp; 2. Bay windows, ledges, roof eaves and other minor building features may encroach into the setback distance up to the extent shown in Table 3 below. Exceptions to the setback and buffer requirements are listed below: Sites with street block controls (refer to the Street Block Plans section); Party-wall3 developments (to be assessed upon formal submission of a proposed development); Flats and condominium developments within the River Valley, Newton and Orchard Planning Areas. The standard road buffer for these shall be 7.5m (of which 3m is green buffer); Flats and condominium developments in the Central Area (PDF, 436 KB) other than those in the River Valley, Newton and Orchard Planning Areas. The required road buffer shall be based on urban design considerations. 1 Road Reserve: The plot of land to be vested in the State as required under the Street Works Act. It is demarcated by the line of Road Reserve in the Road Line Plan and the site boundary. Drainage Reserve: An area safeguarded for purposes of building or widening a public drain. ↩ Street/Road Reserve: The plot of land to be vested in the State as required under the Street Works Act. It is demarcated by the line of Road Reserve in the Road Line Plan and the site boundary. ↩ These guidelines shall apply to the residential component of mixed-use developments (e.g. Residential with Commercial at 1st Storey or Mixed Commercial and Residential developments) ↩"
}
]